OpenFOAM-v1812/tutorials/multiphase/overInterDyMFoam/rigidBodyHull/background/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    "(atmosphere|outlet)"
    {
        type            totalPressure;
        p0              $internalField;
    }

    "(HULL*.*)"
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    "(BLADES|HUB_DISK|HUB)"
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    "(overset-1|oversetPatch)"
    {
        type            overset;
    }
}


// ************************************************************************* //
